app/views/trips/show.html.erb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
<div class="show-style">
  <% passenger = Passenger.find(@trip.passenger_id)%>
  <% driver = Driver.find(@trip.driver_id)%>