app/views/passengers/show.html.erb

SELECT "drivers".* FROM "drivers" WHERE "drivers"."available" = $1  [["available", true]]
---

  <% available_drivers = Driver.where(available: true) %>

SELECT COUNT(*) FROM "trips" WHERE "trips"."passenger_id" = $1  [["passenger_id", 4]]
---
    <br>
  <% if @passenger.trips.count > 0 %>