app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def show
    @driver = Driver.find_by(id: params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def create
    @driver = Driver.new(driver_created)
    if @driver.save
---
INSERT INTO "drivers" ("name", "vin", "available", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Speed"], ["vin", "12345678912345678"], ["available", true], ["created_at", "2020-10-23 17:25:40.456803"], ["updated_at", "2020-10-23 17:25:40.456803"]]

  def edit
    @driver = Driver.find_by(id: params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @driver = Driver.find_by(id: params[:id])
    if @driver.nil?
      head :not_found
      return
    elsif @driver.update(driver_params)
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "drivers" SET "name" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["name", "Speed"], ["updated_at", "2020-10-23 17:25:41.269551"], ["id", 19]]

  def destroy
    @driver = Driver.find_by(id: params[:id])
    if @driver.nil?
      head :not_found
      return
    else
      @driver.destroy
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "drivers" WHERE "drivers"."id" = $1  [["id", 24]]

  def make_available
    @driver = Driver.find_by(id: params[:id])
    if @driver[:available]
      @driver.update(available: false)
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "drivers" SET "available" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["available", true], ["updated_at", "2020-10-23 17:25:41.417409"], ["id", 26]]