app/controllers/passengers_controller.rb

SELECT "passengers".* FROM "passengers"
---
  def index
    @passengers = Passenger.all

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @passenger = Passenger.find_by(id: params[:id])

INSERT INTO "passengers" ("name", "phone_num", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Cathy Cathy"], ["phone_num", "8783 93093 3983"], ["created_at", "2020-10-23 17:25:40.303115"], ["updated_at", "2020-10-23 17:25:40.303115"]]
---
  def create
    @passenger = Passenger.new(passenger_params)

    if @passenger.save

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", -1], ["LIMIT", 1]]
---
  def edit
    @passenger = Passenger.find_by(id: params[:id])

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "passengers" SET "name" = $1, "phone_num" = $2, "updated_at" = $3 WHERE "passengers"."id" = $4  [["name", "Cathy Cathy"], ["phone_num", "90482309480924"], ["updated_at", "2020-10-23 17:25:41.206428"], ["id", 21]]
---
  def update
    @passenger = Passenger.find_by(id: params[:id])
    return head :not_found if @passenger.nil?

    if @passenger.update(passenger_params)

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "passengers" WHERE "passengers"."id" = $1  [["id", 16]]
---
  def destroy
    passenger = Passenger.find_by(id: params[:id])
    if passenger.nil?
      return head :not_found
    else
      passenger.destroy