app/controllers/trips_controller.rb

  def show
    @trip = Trip.find_by(id: params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", -1], ["LIMIT", 1]]

  def edit
    @trip = Trip.find_by(id: params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def update
    @trip = Trip.find_by(id: params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @trip = Trip.find_by(id: params[:id])
    if @trip.nil?
      head :not_found
      return
    else
      @trip.destroy
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 2]]

  def create
    passenger_id = params[:passenger_id]
    rand_cost = rand(10..1000).to_f
    @driver = Driver.where(available: true).first

    if @driver.nil?
      redirect_to passenger_path(passenger_id)
      return
    end

    params_hash = {
      passenger_id: passenger_id,
      date: Date.today,
      cost: rand_cost,
      rating: nil,
      driver_id: @driver.id
    }

    @trip = Trip.new(params_hash)
    if @trip.save
      redirect_to trip_path(@trip.id)
      @driver.update(available: false)
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."available" = $1 ORDER BY "drivers"."id" ASC LIMIT $2  [["available", true], ["LIMIT", 1]]
INSERT INTO "trips" ("date", "cost", "created_at", "updated_at", "passenger_id", "driver_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2020-10-23"], ["cost", 75.0], ["created_at", "2020-10-23 17:25:40.993753"], ["updated_at", "2020-10-23 17:25:40.993753"], ["passenger_id", 17], ["driver_id", 18]]
UPDATE "drivers" SET "available" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["available", false], ["updated_at", "2020-10-23 17:25:40.996645"], ["id", 18]]