app/views/drivers/show.html.erb

SELECT COUNT(*) FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 9]]
---
     <br>
  <strong>Total Trips:</strong> <%= @driver.trips.count %>